## 팀 구성원, 개인 별 역할

---

- 김우용 : 커뮤니티 기능 추가, 공통 템플릿 적용, WebRTC 자료 조사 & 구현
- 김치훈 : 로그인 기능 개선, 공통 템플릿 제작 및 적용, 프론트 작업 및 프로젝트 코드 리팩토링
- 서창민 : 닥터 마이페이지 기능 추가,MAP API, 공통 템플릿 적용, 프론트 작업 및 프로젝트 코드 리팩토링
- 신상원 : 닥터 Q&A 기능 추가, 공통 템플릿 적용, WebRTC 자료 조사 & 구현
- 이주원3 : 고객 마이페이지 기능 추가, 공통 템플릿 제작 및 적용, WebRTC 자료 조사 & 구현

## 팀 내부 회의 진행 회차 및 일자

---

- 11회차 정기회의(2022.08.31) 디스코드 진행(모두 참여)
- 12회차 스프런트 회의(2022.09.02) 디스코드 진행(김치훈, 이주원3, 서창민, 신상원)
- 13회차 소회의(2022.09.03) 디스코드 진행(김치훈, 서창민)
- 14회차 소회의(2022.09.04) 디스코드 진행(김우용, 신상원, 이주원3)

## 현재까지 개발 과정 요약 (최소 500자 이상)

**구현 내용**

1. 김치훈님
    - 로그인 DB 수정
    - 로그인 부분 수정
    - 공통 템플릿 적용 및 템플릿 프로젝트에 맞게 일부 수정
2. 서창민님
    - 세부적인 코드 리팩토링
    - 주소 플랫폼 변경
    - 환자예약, 진료완료, 진단서 DB수정 등 수정 필요한 로직 구상 & 구현
3. 신상원님
    - 쿠키를 사용한 조회수 기능 추가
    - 페이징, 게시글 정렬 등 게시물 관련 기능 추가
    - 공통 템플릿 적용
4. 김우용님
    - 커뮤니티 구현 완료
    - 코드 리팩토링을 통한 버그 수정
5. 이주원3님
    - 임시 예약하기 기능 추가
    - 회원에 따라서 정보 출력하는 기능 추가
    - 공통 템플릿 적용 및 템플릿 프로젝트에 맞게 일부 수정
    - URL 수정

## 개발 과정에서 나왔던 질문 (최소 200자 이상)

### 논의사항

**프론트엔드**

- 부트스트랩 아르곤 템플릿을 기초 바탕으로 하기로 결정
- 필요 없는 부분 제거
- fragment로 요소를 나눔
- layout에 fragment를 합하여 layout으로 만듦

**Git**

- 지금까지는 한꺼번에 PR을 날려서 서로가 서로의 코드리뷰를 하기 어려운 상황이었는데, 이를 잘게 나누어서 서로 기능 구현한 것 & 코드리뷰 진행하기
- 현재 브랜치를 도메인 별로 파서 계속 작업하고 있는데, 이를 새로운 작업 할 때마다 숫자를 붙여서 새로 파고, 기능 구현이 끝나면 브랜치를 삭제하는 식으로 변경

**스프린트 회의**

- 매일 수업 끝나고 최대 20분의 스프린트 회의를 진행함으로써 개발진행상황 공유 및 개발 방향 토의

**테스트 코드**

- 테스트 코드에 대한 필요성에 대해서 모두 동의
- 기본 테스트 데이터를 위한 기초 작업 담당자가 기초 작업 후 브랜치 생성하기
- 각자 테스트 데이터 입력하여 반영하기

**프로젝트**

- 러프하게 필수 기능들 구현하는 것을 우선으로하고, 이후 리팩토링을 통해 성능을 개선함으로써 실력향상 및 이력서에 작성할 내용 추가하면 좋을 것 같음

**Web RTC**

- 역할 분배에 대해 애매한 부분이 있음. 각자 기능을 최소한으로 구현해 봐야 역할 분배를 적절히 할 수 있을 것 같음

### 질문 사항 및 답변 내용

**Web RTC**

1. Node.js로 서버를 따로 구성할 지, Spring에서 진행해 보는게 좋을 지?
    - Web RTC를 구현하기 위해 필요한 Module이 많아 Node가 편할 수 있지만, Node로 하는 것 보다 WebPack을 이용해서 Spring에 필요한 Module을 불러와서 작업해보는 식으로 우선 진행해보기

**프로젝트**

1. 진단서를 DB로 받아오는 것 대신, 파일 자체로 받아오는 방법은 어떤지?
    - 진단서는 보통 공통된 양식이 존재하고, 이를 이용하는 방법이 더 좋을 것 같음

## WBS 변동사항

---

- 완료된 항목은 (완료)로 표시
- 남은 기능 구현에 대하여 조금 더 상세하게 Task를 나눔

## 개발 결과물 공유

---

- Github Repository URL : [https://github.com/likelion-backendschool/animal-care](https://github.com/likelion-backendschool/animal-care)
- wbs: [https://docs.google.com/spreadsheets/d/1tMqUIlmyl2OKtFDN1YOeA4chn9lAe1uLK3NQZCpHmTw/edit#gid=0](https://docs.google.com/spreadsheets/d/1tMqUIlmyl2OKtFDN1YOeA4chn9lAe1uLK3NQZCpHmTw/edit#gid=0)
